{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.5.2", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "IRRCNN", "layers": [{"name": "input_12", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_12"}, "inbound_nodes": []}, {"name": "conv2d_471", "class_name": "Conv2D", "config": {"name": "conv2d_471", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"name": "average_pooling2d_34", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_34", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_471", 0, 0, {}]]]}, {"name": "conv2d_501", "class_name": "Conv2D", "config": {"name": "conv2d_501", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_471", 0, 0, {}]]]}, {"name": "conv2d_505", "class_name": "Conv2D", "config": {"name": "conv2d_505", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_471", 0, 0, {}]]]}, {"name": "conv2d_509", "class_name": "Conv2D", "config": {"name": "conv2d_509", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_34", 0, 0, {}]]]}, {"name": "batch_normalization_455", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_455", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_501", 0, 0, {}]]]}, {"name": "batch_normalization_459", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_459", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_505", 0, 0, {}]]]}, {"name": "batch_normalization_463", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_463", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_509", 0, 0, {}]]]}, {"name": "activation_455", "class_name": "Activation", "config": {"name": "activation_455", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_455", 0, 0, {}]]]}, {"name": "activation_459", "class_name": "Activation", "config": {"name": "activation_459", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_459", 0, 0, {}]]]}, {"name": "activation_463", "class_name": "Activation", "config": {"name": "activation_463", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_463", 0, 0, {}]]]}, {"name": "conv2d_502", "class_name": "Conv2D", "config": {"name": "conv2d_502", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_455", 0, 0, {}]]]}, {"name": "conv2d_506", "class_name": "Conv2D", "config": {"name": "conv2d_506", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_459", 0, 0, {}]]]}, {"name": "conv2d_510", "class_name": "Conv2D", "config": {"name": "conv2d_510", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_463", 0, 0, {}]]]}, {"name": "add_322", "class_name": "Add", "config": {"name": "add_322", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_501", 0, 0, {}], ["conv2d_502", 0, 0, {}]]]}, {"name": "add_325", "class_name": "Add", "config": {"name": "add_325", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_505", 0, 0, {}], ["conv2d_506", 0, 0, {}]]]}, {"name": "add_328", "class_name": "Add", "config": {"name": "add_328", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_509", 0, 0, {}], ["conv2d_510", 0, 0, {}]]]}, {"name": "batch_normalization_456", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_456", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_322", 0, 0, {}]]]}, {"name": "batch_normalization_460", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_460", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_325", 0, 0, {}]]]}, {"name": "batch_normalization_464", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_464", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_328", 0, 0, {}]]]}, {"name": "activation_456", "class_name": "Activation", "config": {"name": "activation_456", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_456", 0, 0, {}]]]}, {"name": "activation_460", "class_name": "Activation", "config": {"name": "activation_460", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_460", 0, 0, {}]]]}, {"name": "activation_464", "class_name": "Activation", "config": {"name": "activation_464", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_464", 0, 0, {}]]]}, {"name": "conv2d_503", "class_name": "Conv2D", "config": {"name": "conv2d_503", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_456", 0, 0, {}]]]}, {"name": "conv2d_507", "class_name": "Conv2D", "config": {"name": "conv2d_507", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_460", 0, 0, {}]]]}, {"name": "conv2d_511", "class_name": "Conv2D", "config": {"name": "conv2d_511", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_464", 0, 0, {}]]]}, {"name": "add_323", "class_name": "Add", "config": {"name": "add_323", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_501", 0, 0, {}], ["conv2d_503", 0, 0, {}]]]}, {"name": "add_326", "class_name": "Add", "config": {"name": "add_326", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_505", 0, 0, {}], ["conv2d_507", 0, 0, {}]]]}, {"name": "add_329", "class_name": "Add", "config": {"name": "add_329", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_509", 0, 0, {}], ["conv2d_511", 0, 0, {}]]]}, {"name": "batch_normalization_457", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_457", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_323", 0, 0, {}]]]}, {"name": "batch_normalization_461", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_461", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_326", 0, 0, {}]]]}, {"name": "batch_normalization_465", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_465", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_329", 0, 0, {}]]]}, {"name": "activation_457", "class_name": "Activation", "config": {"name": "activation_457", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_457", 0, 0, {}]]]}, {"name": "activation_461", "class_name": "Activation", "config": {"name": "activation_461", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_461", 0, 0, {}]]]}, {"name": "activation_465", "class_name": "Activation", "config": {"name": "activation_465", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_465", 0, 0, {}]]]}, {"name": "conv2d_504", "class_name": "Conv2D", "config": {"name": "conv2d_504", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_457", 0, 0, {}]]]}, {"name": "conv2d_508", "class_name": "Conv2D", "config": {"name": "conv2d_508", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_461", 0, 0, {}]]]}, {"name": "conv2d_512", "class_name": "Conv2D", "config": {"name": "conv2d_512", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_465", 0, 0, {}]]]}, {"name": "add_324", "class_name": "Add", "config": {"name": "add_324", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_501", 0, 0, {}], ["conv2d_504", 0, 0, {}]]]}, {"name": "add_327", "class_name": "Add", "config": {"name": "add_327", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_505", 0, 0, {}], ["conv2d_508", 0, 0, {}]]]}, {"name": "add_330", "class_name": "Add", "config": {"name": "add_330", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_509", 0, 0, {}], ["conv2d_512", 0, 0, {}]]]}, {"name": "batch_normalization_458", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_458", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_324", 0, 0, {}]]]}, {"name": "batch_normalization_462", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_462", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_327", 0, 0, {}]]]}, {"name": "batch_normalization_466", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_466", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_330", 0, 0, {}]]]}, {"name": "activation_458", "class_name": "Activation", "config": {"name": "activation_458", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_458", 0, 0, {}]]]}, {"name": "activation_462", "class_name": "Activation", "config": {"name": "activation_462", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_462", 0, 0, {}]]]}, {"name": "activation_466", "class_name": "Activation", "config": {"name": "activation_466", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_466", 0, 0, {}]]]}, {"name": "concatenate_33", "class_name": "Concatenate", "config": {"name": "concatenate_33", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["activation_458", 0, 0, {}], ["activation_462", 0, 0, {}], ["activation_466", 0, 0, {}]]]}, {"name": "conv2d_513", "class_name": "Conv2D", "config": {"name": "conv2d_513", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.9999998989515007e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_33", 0, 0, {}]]]}, {"name": "batch_normalization_467", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_467", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_513", 0, 0, {}]]]}, {"name": "activation_467", "class_name": "Activation", "config": {"name": "activation_467", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_467", 0, 0, {}]]]}, {"name": "global_average_pooling2d_8", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_8", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["activation_467", 0, 0, {}]]]}, {"name": "dropout_32", "class_name": "Dropout", "config": {"name": "dropout_32", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["global_average_pooling2d_8", 0, 0, {}]]]}, {"name": "dense_9", "class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_32", 0, 0, {}]]]}], "input_layers": [["input_12", 0, 0]], "output_layers": [["dense_9", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "SGD", "config": {"learning_rate": 0.009999999776482582, "momentum": 0.0, "decay": 0.0, "nesterov": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_455/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_455/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_455/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_456/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_456/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_456/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_457/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_457/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_457/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_458/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_458/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_458/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_459/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_459/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_459/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_460/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_460/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_460/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_461/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_461/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_461/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_462/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_462/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_462/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_463/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_463/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_463/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_464/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_464/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_464/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_465/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_465/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_465/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_466/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_466/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_466/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_467/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_467/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_467/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv2d_471/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_471/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_501/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv2d_501/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_502/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_502/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_503/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_503/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_504/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_504/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_505/kernel", "shape": [3, 3, 32, 128], "dtype": "float32"}, {"name": "conv2d_505/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_506/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_506/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_507/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_507/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_508/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_508/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_509/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv2d_509/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_510/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_510/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_511/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_511/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_512/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2d_512/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_513/kernel", "shape": [3, 3, 256, 32], "dtype": "float32"}, {"name": "dense_9/kernel", "shape": [32, 4], "dtype": "float32"}, {"name": "dense_9/bias", "shape": [4], "dtype": "float32"}]}]}